library(ggplot2)
library(waffle)

g_mps <- read.csv("https://data.rada.gov.ua/ogd/mps/skl9/mps09-data.csv", # Змінити цифру *mps09-data.csv* відповідно до необхідної Ради 01-09
fileEncoding = "UTF-8")

# Порахувати кількість чоловіків і жінок
g_mps %>% 
  group_by(gender) %>% 
  summarise(n=n())


# Кількість чоловіків і жінок у Верховній Раді з 1-го до 9-го скликання
# Сума нардепів перевищує 450, оскільки ми відображаємо всю кількість нардепів, які проходили крізь парламент

# Gender 
gender_rada <- iron(
  waffle(c(чоловіки = 346, жінки = 92, окуповані=28), rows = 10, size=1, #
         colors = c("#16516f", "#4d1f79", "grey"), title = "Рада-9 (2019 - зараз)"),
  
  waffle(c(чоловіки = 398, жінки = 53, окуповані=27), rows = 10, size=1, # 11
         colors = c("#16516f", "#4d1f79", "grey"), title = "Рада-8 (2014-2019)"),
  
  waffle(c(чоловіки = 432, жінки = 46), rows = 10, size=1,#  10
         colors = c("#16516f", "#4d1f79"), title = "Рада-7 (2012-2014)"),
  
  waffle(c(чоловіки = 496, жінки = 46), rows = 10, size=1,#
         colors = c("#16516f", "#4d1f79"), title = "Рада-6 (2007-2012)"),
  
  waffle(c(чоловіки = 442, жінки = 41), rows = 10, size=1,#
         colors = c("#16516f", "#4d1f79"), title = "Рада-5 (2006-2007)"),
  
  waffle(c(чоловіки = 477, жінки = 28), rows = 10, size=1,#
         colors = c("#16516f", "#4d1f79"), title = "Рада-4 (2002-2006)"),
  
  waffle(c(чоловіки = 441, жінки = 38), rows = 10, size=1,#
         colors = c("#16516f", "#4d1f79"), title = "Рада-3 (1998-2002)"),
  
  waffle(c(чоловіки = 418, жінки = 18), rows = 10, size=1,#
         colors = c("#16516f", "#4d1f79"), title = "Рада-2 (1994-1998)"), 
  
  waffle(c(чоловіки = 463, жінки = 12), rows = 10, size=1,#
         colors = c("#16516f", "#4d1f79"), title = "Рада-1 (1990-1994)")
)


# Відсоток чоловіків і жінок у Верховній Раді з 1-го до 9-го скликання
# Відсотки пораховані від суми всіх нардепів (тобто кількість у 450 чоловіків перевищена), які набували повноваження

gender_rada <- iron(
  waffle(c(чоловіки = 74, жінки = 20, окуповані=6), rows = 5, size=1, #
         colors = c("#16516f", "#4d1f79", "grey"), title = "Рада-9 (2019 - зараз)"),
  
  waffle(c(чоловіки = 83, жінки = 11, окуповані=6), rows = 5, size=1, # 83, 11, 6
         colors = c("#16516f", "#4d1f79", "grey"), title = "Рада-8 (2014-2019)"),
  
  waffle(c(чоловіки = 90, жінки = 10), rows = 5, size=1,# 90, 10
         colors = c("#16516f", "#4d1f79"), title = "Рада-7 (2012-2014)"),
  
  waffle(c(чоловіки = 92, жінки = 8), rows = 5, size=1,# 92  8 
         colors = c("#16516f", "#4d1f79"), title = "Рада-6 (2007-2012)"),
  
  waffle(c(чоловіки = 92, жінки = 8), rows = 5, size=1,# 92,
         colors = c("#16516f", "#4d1f79"), title = "Рада-5 (2006-2007)"),
  
  waffle(c(чоловіки = 94, жінки = 6), rows = 5, size=1,# 94
         colors = c("#16516f", "#4d1f79"), title = "Рада-4 (2002-2006)"),
  
  waffle(c(чоловіки = 92, жінки = 8), rows = 5, size=1,# 92
         colors = c("#16516f", "#4d1f79"), title = "Рада-3 (1998-2002)"),
  
  waffle(c(чоловіки = 96, жінки = 4), rows = 5, size=1,# 96
         colors = c("#16516f", "#4d1f79"), title = "Рада-2 (1994-1998)"), 
  
  waffle(c(чоловіки = 97, жінки = 3), rows = 5, size=1, # 97
         colors = c("#16516f", "#4d1f79"), title = "Рада-1 (1990-1994)")
)

gender_rada
